Revit 2027 API
Form.GetControlPoints Method
Given an edge or a curve or a face, return all control points lying on it (in form of geometry references).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReferenceArray GetControlPoints(
	Reference curveOrEdgeOrFaceReference
)
Public Function GetControlPoints (
	curveOrEdgeOrFaceReference As Reference
) As ReferenceArray
public:
ReferenceArray^ GetControlPoints(
	Reference^ curveOrEdgeOrFaceReference
)
member GetControlPoints :
        curveOrEdgeOrFaceReference : Reference -> ReferenceArray
Parameters
curveOrEdgeOrFaceReference Reference
The reference of an edge or curve or face.
Return Value
ReferenceArray
Reference array containing all control points lying on it.
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace